import 'package:flutter/material.dart';
import 'package:leva_matrimonial/utils/labels.dart';

class AboutPage extends StatelessWidget {
  const AboutPage({Key? key}) : super(key: key);
  static const route = "/about";
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text(Labels.aboutUs),
      ),
      body: SingleChildScrollView(
        child: Padding(
          padding: const EdgeInsets.all(24),
          child: Text(
            // "लेवा नवयुवक संघ नोंदणीकृत धर्मादाय संस्था आहे. आम्ही मागील ३४ वर्षापासून लेवा पाटीदार समाजासाठी कार्यरत आहोत."
            // "आम्ही कोणतीही देणगी स्वीकारत नाही.",
            """विवाहेच्छुकांना त्यांच्या मनाजोगते विवाहस्थळ शोधणे फार मोठे आव्हान असते. याच आव्हानांवर मात करण्यासाठी लेवा पाटीदार समाजातील सकारात्मक विचारधारी व्यक्तींनी एकत्र येऊन गिरणा-तापी सांस्कृतिक मंडळाची स्थापना कै. प्रा. रामचंद्र दशरथ भोळे यांच्या पुढाकाराने १९८७ मध्ये केली. याच छत्राखाली पहिला विवाहेच्छुक वधू-वर मेळावा घेतला. सन २००१ पासून कै. युवराज महाजन व त्यांचे सहकारी या सर्व नवयुवकांनी मिळून लेवा नवयुवक संघाची स्थापना केली.\n
      गेल्या १९ वर्षांपासून लेवा नवयुवक संघ वधू-वर मेळाव्याचे आयोजन यशस्वीरित्या करत आहे. वधू-वर परिचय मेळावा हि काळाची गरज आहे. सर्व जगभर विखुरलेल्या लेवा पाटीदार समाजाच्या विवाहेच्छुक वधू-वरांच्या नाव नोंदणीसाठी जवळपास ३०० फार्म कलेक्शन सेंटरचे जाळे लेवा नवयुवक संघाने विणलेले आहे. दरवर्षी वैशिष्ट्यपूर्ण वधू-वर सूचीचे प्रकाशन होते- जळगांवच्या वधू-वर सूचीचे वैशिष्ट्ये म्हणजे वधू-वरांचे शिक्षणानुसार व वयानुसार वर्गीकरण केले आहे. यामुळे मनाजोगा जोडीदार शोधण्यास सुलभ होते.\n  
      लेवा नवयुवक संघ नोंदणीकृत धर्मदाय संस्था आहे. आम्ही कुठलीही देणगी स्वीकारत नाही.""",
            style: Theme.of(context).textTheme.titleLarge,
          ),
        ),
      ),
    );
  }
}
